<template>
    <div class="about">
        {{text ? text : defaultText}}
    </div>
</template>

<script>
    import AboutService from "../../services/about";

    export default {
        name: 'About',
        data: () => ({
            text: '',
            defaultText: 'Сайт предназначен для оптовых продаж пластиковых органайзеров с выдвижными ячейками юридическим лицам и\n        индивидуальным предпринимателям. На страницах сайта представлен ассортимент органайзеров, который Вы можете\n        приобрести для своей торговой точки, магазина, склада.\n        Мы предлагаем сотрудничество с первым импортёром, выгодные цены, информационную поддержку, самовывоз или\n        доставку транспортной компанией в большинство регионов Республики Беларусь.\n        Пластиковые органайзеры с выдвижными ячейками позволяют сортировать и хранить в строгом порядке мелкие детали,\n        обеспечивая лёгкий доступ к ним. Они используются для хранения товаров и продукции на производствах, складах,\n        магазинах, непосредственно на рабочем месте работников компаний с самой широкой сферой деятельности. При этом\n        товары и продукция могут быть самыми разнообразными: металлические и пластиковые крепёжные изделия, товары\n        радиоэлектронной промышленности, мебельная и швейная фурнитура, технический инвентарь, канцелярские и офисные\n        принадлежности, рыболовные снасти, снаряжение для охоты и прочее.\n        На страницах сайта представлены пластиковые органайзеры с выдвижными ячейками разных размеров и разных форм. В\n        одном органайзере может быть одна, два, три, четыре, шесть и девять выдвижных ячеек. На нашем сайте вы можете\n        приобрести также перегородки к выдвижным ячейкам, которые разделяя рабочее пространство ячейки, позволяют в\n        одной ячейке, хранить несколько типов изделий, товаров. Сами ячейки выполнены из прозрачного пластика, что\n        позволяет быстро искать и опознавать нужный товар. Ручки ячеек выполнены таким образом, что на них удобно\n        размещать, наклеивать названия товаров, их артикулы и коды.\n        Уникальной особенностью пластиковых органайзеров с выдвижными ячейками является их способность стыковаться с\n        однотипными органайзерами и друг с другом. Такая возможность возможна благодаря направляющим, которые\n        расположены на всех внешних сторонах органайзера. Благодаря этому можно создавать целые шкафы-стеллажи ячеек. В\n        таких конструкциях могут быть собраны однотипные органайзеры с различным количеством выдвижных ячеек. Это\n        позволяет организовать работу с товаром на складе, в магазине, в офисе максимально удобным и эргономичным\n        способом.'
        }),
        created() {
            AboutService.getAbout().then(({data}) => {
                this.text = data[0].about;
            })
        }
    }

</script>

<style>
    .about {
        padding: 10px;
        font-weight: bold;
    }
</style>